[{"issue_title": "Throw errors that better identify the user-facing function", "tags": ["R-programming", "Data-analysis", "Data-visualization", "Data-manipulation", "Data-tidying", "Data-import", "Functional-programming", "Tibbles", "Strings", "Factors", "Date-times", "Conflict-resolution", "Package-management", "Package-updates", "Additional-packages", "Times", "SPSS-SAS-Stata-files", "Web-apis", "JSON", "XML", "Modelling", "Contributor-Code-of-Conduct"], "summary": "The tidyverse repository contains a collection of R packages designed to work in harmony through shared data representations and API design. The tidyverse package makes it easy to install and load core packages such as ggplot2, dplyr, tidyr, readr, purrr, tibble, stringr, forcats, and lubridate. It also provides a condensed summary of conflicts with other loaded packages. The repository includes packages for data visualization, manipulation, tidying, import, functional programming, tibbles, strings, factors, and date/times."}, {"issue_title": "Make it easier to discover and exploit the `\"tidyverse.quiet\"` option", "tags": ["R-programming", "data-manipulation", "data-visualization", "tidyverse", "r-packages", "data-tidying", "data-import", "functional-programming", "tibbles", "strings", "factors", "date-times", "conflict-resolution", "package-management", "core-tidyverse", "tidyverse-packages", "vector-types", "web-apis", "data-modeling", "contributor-code-of-conduct"], "summary": "The tidyverse repository contains a collection of R packages designed to work in harmony through shared data representations and API design. The tidyverse package simplifies installation and loading of core packages such as ggplot2, dplyr, tidyr, readr, purrr, tibble, stringr, forcats, and lubridate. It also provides a condensed summary of conflicts with other loaded packages. The repository includes packages for data visualization, manipulation, tidying, import, functional programming, and working with tibbles, strings, factors, and date/times."}, {"issue_title": "Tidyverse wide edition", "tags": ["Data-Visualization", "Data-Manipulation", "Data-Tidyying", "Data-Import", "Functional-Programming", "Data-Frames", "Strings", "Factors", "Date-Times", "Package-Management", "Conflict-Resolution", "Package-Updates", "Data-Analysis", "Data-Types", "Web-APIs", "JSON", "Excel-Files", "Web-Scraping", "XML", "Modelling"], "summary": "The tidyverse repository contains a collection of R packages that are designed to work together seamlessly, providing a consistent and intuitive interface for data manipulation, analysis, and visualization. The tidyverse package serves as a convenient entry point, installing and loading the core packages: ggplot2, dplyr, tidyr, readr, purrr, tibble, stringr, forcats, and lubridate. This repository also includes a selection of other packages that are frequently used, such as hms, feather, haven, httr, jsonlite, readxl, rvest, xml2, modelr, and broom."}]