[{"issue_title": "Non-literal class parameter types should be deprecated not a warning", "summary": "This issue has been migrated to PUP-12026 in the Perforce tracking system."}, {"issue_title": "Package type should support environment variables", "summary": "The issue discusses the addition of an 'environment' parameter to 'Puppet::Type::Package' to support situations where 'sudo' package won't uninstall when there is no root password set. The implementation would involve passing the 'environment' parameter into the 'Puppet::Util::Execution.execute' method as a 'custom-environment'. The discussion also includes the need to account for the 'has_command' DSL method. A branch has been created to explore different options for implementation."}, {"issue_title": "Provide an option to disable catalog messages", "summary": "This issue has been migrated to [PUP-12023](https://perforce.atlassian.net/browse/PUP-12023)"}, {"issue_title": "Improve error handling when catalog contains binary data", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "Thread conflict in Puppet::Pops::Loaders", "summary": "Issue reported from PUP-11324, previously tracked in a read-only Atlassian. Discussion includes potential solutions for protecting against concurrent access in the `Loaders` instance methods that mutate state. Suggestions include locking the environment object and relooking up loaders inside the lock. Issue currently has 'help wanted' label and welcomes pull requests. Additional comments discuss potential threading issues and the need for review of any changes to avoid deadlock conditions."}, {"issue_title": "Package provider \"pip\" not fully functional with network urls on Ubuntu 22.04", "summary": "This issue is related to a fix in pull request #9280 and has been migrated to PUP-12027."}, {"issue_title": "Private key and client certificate warning messages on a Masterless Puppet Environment", "summary": "The agent is not handling cases where a client cert is not available, leading to failure in establishing a mTLS connection to the `source`. This issue is related to PUP-11331 but is distinct as it focuses on the agent's behavior in masterless environments."}, {"issue_title": "Misleading warning when fact values limit is exceeded", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "Long delay when printing catalog server in Puppet 7.28.0 on IPv6-only clients", "summary": "Issue regarding disabling IPv4 on a dual stack machine in Puppet. The reporter was unable to provide definite steps to reproduce the issue as it varies depending on the server instance and OS family. A sample `/etc/network/interfaces` file was provided for replication. The issue was migrated to PUP-12022."}, {"issue_title": "Environment names can't contain only integer", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}]