{"markdown": "# Puppet\n\n![RSpec tests](https://github.com/puppetlabs/puppet/workflows/RSpec%20tests/badge.svg)\n[![Gem Version](https://badge.fury.io/rb/puppet.svg)](https://badge.fury.io/rb/puppet)\n[![Inline docs](https://inch-ci.org/github/puppetlabs/puppet.svg)](https://inch-ci.org/github/puppetlabs/puppet)\n\nPuppet, an automated administrative engine for your Linux, Unix, and Windows systems, performs\nadministrative tasks (such as adding users, installing packages, and updating server\nconfigurations) based on a centralized specification.\n\n## Documentation\n\nDocumentation for Puppet and related projects can be found online at the\n[Puppet Docs site](https://puppet.com/docs).\n\n### HTTP API\n\n[HTTP API Index](https://puppet.com/docs/puppet/latest/http_api/http_api_index.html)\n\n## Installation\n\nThe best way to run Puppet is with [Puppet Enterprise (PE)](https://puppet.com/products/puppet-enterprise/),\nwhich also includes orchestration features, a web console, and professional support.\nThe PE documentation is [available here.](https://puppet.com/docs/pe/latest)\n\nTo install an open source release of Puppet,\n[see the installation guide on the docs site.](https://puppet.com/docs/puppet/latest/installing_and_upgrading.html)\n\nIf you need to run Puppet from source as a tester or developer,\nsee the [Quick Start to Developing on Puppet](docs/quickstart.md) guide.\n\n## Developing and Contributing\n\nWe'd love to get contributions from you! For a quick guide to getting your\nsystem setup for developing, take a look at our [Quickstart\nGuide](https://github.com/puppetlabs/puppet/blob/main/docs/quickstart.md). Once you are up and running, take a look at the\n[Contribution Documents](https://github.com/puppetlabs/puppet/blob/main/CONTRIBUTING.md) to see how to get your changes merged\nin.\n\nFor more complete docs on developing with Puppet, take a look at the\nrest of the [developer documents](https://github.com/puppetlabs/puppet/blob/main/docs/index.md).\n\n## Licensing\n\nSee [LICENSE](https://github.com/puppetlabs/puppet/blob/main/LICENSE) file. Puppet is licensed by Puppet, Inc. under the Apache license. Puppet, Inc. can be contacted at: info@puppet.com\n\n## Support\n\nPlease log issues in this project's [GitHub Issues](https://github.com/puppetlabs/puppet/issues). A [mailing\nlist](https://groups.google.com/forum/?fromgroups#!forum/puppet-users) is\navailable for asking questions and getting help from others, or if you prefer chat, we also have a [Puppet Community slack.](https://puppetcommunity.slack.com/)\n\nWe use semantic version numbers for our releases and recommend that users stay\nas up-to-date as possible by upgrading to patch releases and minor releases as\nthey become available.\n\nBug fixes and ongoing development will occur in minor releases for the current\nmajor version. Security fixes will be backported to a previous major version on\na best-effort basis, until the previous major version is no longer maintained.\n\nFor example: If a security vulnerability is discovered in Puppet 8.1.1, we\nwould fix it in the 8 series, most likely as 8.1.2. Maintainers would then make\na best effort to backport that fix onto the latest Puppet 7 release.\n\nLong-term support, including security patches and bug fixes, is available for\ncommercial customers. Please see the following page for more details:\n\n[Puppet Enterprise Support Lifecycle](https://puppet.com/docs/puppet-enterprise/product-support-lifecycle/)\n"}