[{"issue_title": "Deprecate osx_profile resource since it can longer silently install profiles", "summary": "There is a suggestion to fully remove a certain feature without any deprecation notice, as Chef only supports macOS 12 and higher. The resource related to this feature will cause Chef to fail on a supported version of macOS if not explicitly marked with `ignore_failure true`. The current version of macOS that will reach its end-of-life soon is Apple macOS 11."}, {"issue_title": "Bump omnibus-software from `40ca2a9` to `842b603` in /omnibus", "summary": "Quality Gate passed for the latest code analysis on SonarCloud with 0 new issues and 0 accepted issues. No data available for Security Hotspots, Coverage, and Duplication."}, {"issue_title": "Bump omnibus-software from `86649fa` to `842b603` in /omnibus", "summary": "Quality Gate passed for the latest code analysis on SonarCloud with 0 new issues and 0 accepted issues. No data about security hotspots, coverage, and duplication."}, {"issue_title": "OpenSSL 3.0.9 upgrade - merge after 17.11.x", "summary": "Quality Gate passed for issue with 0 new and accepted issues, 0 security hotspots, no data about coverage, and 0.0% duplication on new code. Analysis details can be found on SonarCloud."}, {"issue_title": "apt_repository should not use deprecated apt-key anymore", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "chef_client_config errors out for bool property", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "'log' resource ignores the 'message' attribute, and will always use the name of the resource as the message", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "Bump kitchen-vagrant from 1.14.1 to 2.0.0 in /omnibus", "summary": "Quality Gate passed for the pull request 14240 in the chef repository with 0 new issues and 0 accepted issues. No data about Coverage and Duplication. See analysis details on SonarCloud."}, {"issue_title": "18.4.2 windows_service property \"description\": NoMethodError", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}, {"issue_title": "Cloud helper functions return incorrect results after nodes are moved between clouds (Azure -> AWS)", "summary": "Discussion on the potential security vulnerability in the library's encryption method and a request for a fix or workaround."}]